
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Управленческий.Записывать = Истина;
	
	Курс = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта)).Курс;
	
	Движения.Управленческий.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.Товары);
	
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК КоличествоДок,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК СуммаДок
		|ПОМЕСТИТЬ ДанныеТЧ
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеТЧ.Номенклатура КАК Номенклатура,
		|	ДанныеТЧ.КоличествоДок КАК КоличествоДок,
		|	ДанныеТЧ.СуммаДок КАК СуммаДок,
		|	ЕСТЬNULL(УправленческийОстаткиПоСкладу.КоличествоОстатокДт, 0) КАК КоличествоОстатокДт,
		|	ЕСТЬNULL(УправленческийОстаткиПоВсемСкладам.КоличествоОстатокДт, 0) КАК КоличествоОстатокДтВсе,
		|	ЕСТЬNULL(УправленческийОстаткиПоВсемСкладам.СуммаРубОстатокДт, 0) КАК СуммаРубОстатокДтВсе,
		|	ДанныеТЧ.Номенклатура.Представление КАК НоменклатураПредставление
		|ИЗ
		|	ДанныеТЧ КАК ДанныеТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
		|				&МомВремени,
		|				Счет = &Товары,
		|				&Субконто,
		|				Организация = &Организация
		|					И Субконто1 В
		|						(ВЫБРАТЬ
		|							ДанныеТЧ.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ДанныеТЧ КАК ДанныеТЧ)
		|					И Субконто2 = &Склад) КАК УправленческийОстаткиПоСкладу
		|		ПО ДанныеТЧ.Номенклатура = УправленческийОстаткиПоСкладу.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
		|				&МомВремени,
		|				Счет = &Товары,
		|				&Субконто,
		|				Организация = &Организация
		|					И Субконто1 В
		|						(ВЫБРАТЬ
		|							ДанныеТЧ.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ДанныеТЧ КАК ДанныеТЧ)) КАК УправленческийОстаткиПоВсемСкладам
		|		ПО ДанныеТЧ.Номенклатура = УправленческийОстаткиПоВсемСкладам.Субконто1";
	
	Запрос.УстановитьПараметр("МомВремени", МоментВремени());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склады);
	
	Запрос.УстановитьПараметр("Субконто", Субконто);
	Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоДок > ВыборкаДетальныеЗаписи.КоличествоОстатокДт Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По номенклатуре " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + 
				" не хватает товара. Реально есть: " + ВыборкаДетальныеЗаписи.КоличествоОстатокДт;
			Сообщение.Сообщить(); 
			
			Отказ = Истина;
		КонецЕсли;
		
		Если Не Отказ Тогда
			// регистр Управленческий 
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Управленческий.ПрибылиУбытки;
			Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.КоличествоКт = ВыборкаДетальныеЗаписи.КоличествоДок;
			
			//Проблема копеек
			Себестоимость = ?(Движение.КоличествоКт = ВыборкаДетальныеЗаписи.КоличествоОстатокДтВсе, 
				ВыборкаДетальныеЗаписи.СуммаРубОстатокДтВсе,
				ВыборкаДетальныеЗаписи.СуммаРубОстатокДтВсе / ВыборкаДетальныеЗаписи.КоличествоОстатокДтВсе * Движение.КоличествоКт);
			
			Движение.СуммаРуб = Себестоимость;
			
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
			
			// регистр Управленческий 
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Управленческий.Покупатели;
			Движение.СчетКт = ПланыСчетов.Управленческий.ПрибылиУбытки;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ВалютаДт = Валюта;
			Движение.СуммаРуб = ВыборкаДетальныеЗаписи.СуммаДок;
			Движение.СуммаВалДт = ?(Курс = 0, 0, ВыборкаДетальныеЗаписи.СуммаДок / Курс);
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура;
		КонецЕсли; 
	КонецЦикла;

	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
