
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Курс = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта)).Курс;
	
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКонтрагентов Из СписокКонтрагентов Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Управленческий.Касса;
		Движение.СчетКт = ПланыСчетов.Управленческий.Покупатели;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ВалютаКт = Валюта;
		Движение.СуммаРуб = ТекСтрокаСписокКонтрагентов.Сумма * Курс;
		Движение.СуммаВалКт = ТекСтрокаСписокКонтрагентов.Сумма;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = ТекСтрокаСписокКонтрагентов.Контрагент;
	КонецЦикла;
	
	Движения.Управленческий.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправленческийОстатки.Субконто1.Представление КАК КонтрагентПредставление,
		|	УправленческийОстатки.СуммаВалОстаток КАК СуммаВалОстаток
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Остатки(
		|			&Граница,
		|			Счет = &Покупатели,
		|			&Субконто,
		|			Валюта = &Валюта
		|				И Организация = &Организация
		|				И Субконто1 В (&Список)) КАК УправленческийОстатки
		|ГДЕ
		|	УправленческийОстатки.СуммаВалОстаток < 0";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
	Запрос.УстановитьПараметр("Список", СписокКонтрагентов.ВыгрузитьКолонку("Контрагент"));
	
	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагент);
	
	Запрос.УстановитьПараметр("Субконто", Субконто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По контрагенту: " + ВыборкаДетальныеЗаписи.КонтрагентПредставление +
			" произошла переплата на сумму в валюте: " + -ВыборкаДетальныеЗаписи.СуммаВалОстаток;
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЦикла;


	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
